---
kind: property
id: P:Autodesk.Revit.DB.PrintManager.ViewSheetSetting
source: html/7f288fd8-6cfb-efa7-9611-26773b5ff492.htm
---
# Autodesk.Revit.DB.PrintManager.ViewSheetSetting Property

The ViewSheetSetting which manages the view/sheet set information of current document, and you can change the default view/sheet
set for current project.

## Syntax (C#)
```csharp
public ViewSheetSetting ViewSheetSetting { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown when the print range is not selected views/sheets.